In [4]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [7]:
wage_csv = "min_wage.csv"
min_wage_df = pd.read_csv(wage_csv)
min_wage_df

,Year,State,Table_Data,Footnote,High.Value,Low.Value,CPI.Average,High.2018,Low.2018
0,1968,Alabama,...,NaN,0.00000,0.00000,34.783333,0.00,0.00
1,1968,Alaska,2.1,NaN,2.10000,2.10000,34.783333,15.12,15.12
2,1968,Arizona,18.72 - 26.40/wk(b),(b),0.66000,0.46800,34.783333,4.75,3.37
3,1968,Arkansas,1.25/day(b),(b),0.15625,0.15625,34.783333,1.12,1.12
4,1968,California,1.65(b),(b),1.65000,1.65000,34.783333,11.88,11.88
...,...,...,...,...,...,...,...,...,...
2745,2017,Virginia,7.25[c],[c],7.25000,7.25000,245.119583,7.41,7.41
2746,2017,Washington,11,NaN,11.00000,11.00000,245.119583,11.24,11.24
2747,2017,West Virginia,8.75,NaN,8.75000,8.75000,245.119583,8.94,8.94
2748,2017,Wisconsin,7.25,NaN,7.25000,7.25000,245.119583,7.41,7.41
2749,2017,Wyoming,5.15,NaN,5.15000,5.15000,245.119583,5.26,5.26

In [14]:
crime_csv = "crime_data.csv"
crime_data_df = pd.read_csv(crime_csv)
crime_data_df

,State,Area,Unnamed: 2,Population,Violent\ncrime,Murder and \nnonnegligent \nmanslaughter,Rape\n(legacy\ndefinition),Robbery,Aggravated \nassault,Property \ncrime,Burglary,Larceny-\ntheft,Motor \nvehicle \ntheft
0,ALABAMA,State Total,NaN,"4,863,300","25,886",407,"1,385","4,686","18,877","143,362","34,065","97,574","11,723"
1,ALASKA,State Total,NaN,"741,894","5,966",52,757,850,"4,011","24,876","4,053","17,766","3,057"
2,ARIZONA,State Total,NaN,"6,931,071","32,583",380,"2,452","7,055","21,858","206,432","37,736","150,275","18,421"
3,ARKANSAS,State Total,NaN,"2,988,248","16,461",216,"1,545","2,120","11,982","97,673","23,771","66,747","7,155"
4,CALIFORNIA,State Total,NaN,"39,250,017","174,796","1,930","10,149","54,789","104,375","1,002,070","188,304","637,010","176,756"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
75,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
76,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
77,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
78,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Create new data with select columns

In [13]:
new_min_df = min_wage_df[['Year', 'State', 'High.Value', 'Low.Value', 'High.2018', 'Low.2018']].copy()
new_min_df.head()

   Year       State  High.Value  Low.Value  High.2018  Low.2018
0  1968     Alabama     0.00000    0.00000       0.00      0.00
1  1968      Alaska     2.10000    2.10000      15.12     15.12
2  1968     Arizona     0.66000    0.46800       4.75      3.37
3  1968    Arkansas     0.15625    0.15625       1.12      1.12
4  1968  California     1.65000    1.65000      11.88     11.88

In [ ]:
csv_fle =

### Clean DataFrame

In [ ]:
new_customer_location_df = customer_location_df[["id", "address", "us_state"]].copy()
new_customer_location_df.head()

### Connect to local database

In [ ]:
rds_connection_string = "<insert user name>:<insert password>@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [ ]:
engine.table_names()

### Use pandas to load csv converted DataFrame into database

In [ ]:
new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [ ]:
new_customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [ ]:
pd.read_sql_query('select * from customer_name', con=engine).head()

### Confirm data has been added by querying the customer_location table

In [ ]:
pd.read_sql_query('select * from customer_location', con=engine).head()